{
  "items": [
    {
      "name": "Benjamin Smith",
      "role": "Director of Technology, Speaker, Consultant",
      "quote": "Leslie is an extremely detailed and thoughtful frontend architect that dedicates herself to her craft. She takes the time and care required to fully understand project requirements and use cases. She excels at the \"human\" side of development as well, including leadership, empathy, and understanding user behavior. She deeply cares about her projects, and it shows in the final output.",
      "link": "http://linkedin.com/in/benjaminsmithweb/",
      "image": "https://media.licdn.com/mpr/mpr/shrinknp_100_100/AAEAAQAAAAAAAAVDAAAAJGQ1ZjZhMWIyLTFhYmEtNDg4Yy1hM2JlLWQ0OGQwNWQxZjRkMA.jpg",
      "date": "December 22, 2016, Benjamin managed Leslie directly"
    },
    {
      "name": "Bill Schwebel",
      "role": "General Manager/SVP - Marketing and Product",
      "quote": "Leslie managed Front End Development activities for INTTRA during a critical period where we launched several new customer branded services across automotive, mobile, and media including Ford, Audi, and Samsung.  She successfully navigated our business and technical organizations while serving the customer on time and under budget.  Leslie brings a fresh but simple approach to delivering tight and functional web and mobile services that leverages platform capabilities that she builds.",
      "link": "http://linkedin.com/in/billschwebel/",
      "image": "https://media.licdn.com/mpr/mpr/shrinknp_100_100/AAEAAQAAAAAAAAVDAAAAJGQ1ZjZhMWIyLTFhYmEtNDg4Yy1hM2JlLWQ0OGQwNWQxZjRkMA.jpg",
      "date": "September 25, 2015, Bill managed Leslie directly"
    },
    {
      "name": "John Hurr",
      "role": "Design Director at INRIX",
      "quote": "Leslie managed Front End Development activities for INTTRA during a critical period where we launched several new customer branded services across automotive, mobile, and media including Ford, Audi, and Samsung.  She successfully navigated our business and technical organizations while serving the customer on time and under budget.  Leslie brings a fresh but simple approach to delivering tight and functional web and mobile services that leverages platform capabilities that she builds.",
      "link": "http://linkedin.com/in/billschwebel/",
      "image": "https://media.licdn.com/mpr/mpr/shrinknp_100_100/AAEAAQAAAAAAAAVDAAAAJGQ1ZjZhMWIyLTFhYmEtNDg4Yy1hM2JlLWQ0OGQwNWQxZjRkMA.jpg",
      "date": "September 25, 2015, Bill managed Leslie directly"
    },
    {
      "name": "Sergei Tuterov",
      "role": "Product Designer at Facebook",
      "quote": "Leslie is a super dedicated individual, who isn't afraid to get roll up her elbows and work hard to get the project finished. She worked with our consumer mobile team on some of the biggest b2b projects, and was very pleasant to work with.",
      "link": "http://linkedin.com/in/sergei-tuterov/",
      "image": "https://media.licdn.com/mpr/mpr/shrinknp_100_100/AAEAAQAAAAAAAAiKAAAAJDY1ZDVkZTRmLWIzMmItNDU2NC1iYjlmLTE3NDFhMWViNjAwZA.jpg",
      "date": "September 12, 2013, Leslie worked with Sergei in the same group"
    },
    {
      "name": "Vu Nguyen",
      "role": "Head of Product at OpenSensors.io",
      "quote": "Leslie is great and very easy to work with. She understands what is needed in a project and how to build it quickly. I look forward to working with her in the future.",
      "link": "http://linkedin.com/in/vuanguyen/",
      "image": "https://media.licdn.com/mpr/mpr/shrinknp_100_100/AAEAAQAAAAAAAAXuAAAAJDliNTNkNzI3LTNlZmItNDA5ZC1iMWU4LWYyZjc3NTAzNWNiNQ.jpg",
      "date": "September 6, 2013, Vu worked with Leslie in different groups"
    },
    {
      "name": "Mark Timms",
      "role": "Senior Product Manager at HERE Technologies",
      "quote": "Leslie joined the INRIX media team prior to a critical V1.0 release.  The project was at risk of missing the target launch window due to the complex nature of our underlying data.  Leslie was able to quickly identify the project bottlenecks and coordinate the team, bringing the SoW back on track.<br><br>The media team is spread over 3 times zones (8hrs) and Leslie was not only able to effectively integrate herself into these but quickly set about improving communication between all stakeholders - including external contractors.<br><br>Leslie was approachable, acted on instructions in a timely manner and went above and beyond her contracted brief.",
      "link": "http://linkedin.com/in/timmsmark/",
      "image": "https://media.licdn.com/mpr/mpr/shrinknp_100_100/p/1/000/235/009/3c50f46.jpg",
      "date": "September 4, 2013, Mark was a client of Leslie’s"
    },
    {
      "name": "Bryn Mills",
      "role": "Group Manager - Incidents & Media and Group Manager - Content &amp; Delivery Quality at INRIX",
      "quote": "September 4, 2013, Bryn was a client of Leslie’s",
      "link": "http://linkedin.com/in/bryn-mills-2719516/",
      "image": "https://media.licdn.com/mpr/mpr/shrinknp_100_100/p/3/000/1bb/379/19e584a.jpg",
      "date": " Leslie is a passionate, committed and creative web developer and program manager who is able to create innovative solutions while managing complex and evolving requirements. She would be an asset to any organization."
    },
    {
      "name": "Christopher Burgess",
      "role": "Security/Privacy/Intelligence writer",
      "quote": "The ease with which Leslie produces results is testament to her technology prowess. In 2009, I was looking for assistance in design and implementation of a new brand/website. I had met Leslie at the 2008 Gnomedex conference (demonstrative evidence of her interest in the humanity side of technology) and had been shown some of her prior work.<br><br>She provided to me, great advice on all facets of the website digging into the minutia, which I hadn't given any thought.  We took her advice and evolved a website which has been consistently achieving the goals for which it was created.<br><br>I would not hesitate to call on Leslie again, for consultation surround design and implementation.",
      "link": "http://linkedin.com/in/burgessc/",
      "image": "https://media.licdn.com/mpr/mpr/shrinknp_100_100/AAEAAQAAAAAAAAeiAAAAJGNhOGQ3NTJmLTc3ZGEtNGM2MS1iZDYwLWY5MWMyZTc2ODU0Nw.jpg",
      "date": "July 4, 2012, Christopher was a client of Leslie’s"
    },
    {
      "name": "Erin Kotecki Vest",
      "role": "ocial Media Strategist, Journalist, Writer",
      "quote": "Leslie has a fantastic reputation for being a responsible and kick-ass employee. Having run in the same business circles for years I have never heard anything but wonderful things about her work.",
      "link": "http://linkedin.com/in/erinkoteckivest/",
      "image": "https://media.licdn.com/mpr/mpr/shrinknp_100_100/p/3/000/0b4/2c8/1a6c7c9.jpg",
      "date": "July 1, 2012, Erin worked with Leslie in different groups"
    },
    {
      "name": "Michelle Lamar Christman",
      "role": "Manager, Social Media Marketing",
      "quote": "Leslie is a genius when it comes to CMS integration and online content strategy.  Leslie is skilled on the nuts and bolts of content marketing and she's an accomplished writer in her own right.  She brings her special blend of marketing and creative skills to every project she works on.",
      "link": "http://linkedin.com/in/michellelamar/",
      "image": "https://media.licdn.com/mpr/mpr/shrinknp_100_100/p/3/000/00d/1d9/0b6c4f1.jpg",
      "date": "June 21, 2012, Michelle worked with Leslie but at different companies"
    },
    {
      "name": "Emily Lewis",
      "role": "Web expert, trusted partner, small business owner. I’m obsessed with impeccable work and even better client service.",
      "quote": "Leslie is one of the most talented designers and developers I've had the pleasure of knowing. Her front-end design skills with advanced HTML, CSS and JS are second-to-none, while her vast expertise in backend programming and ExpressionEngine development leaves me in awe. This rare combination of designer/developer means that she not only delivers usable, standards-based sites on the front-end, but provides her clients user-friendly, optimized CMSes to drive the content and functionality of those sites.<br><br>But more than Leslie's technical skills, her people skills are truly what sets her apart. She's always been hugely active in the web community, sharing knowledge and helping others. She brings this same communication style to her clients, open to helping all members of the team and dedicated to making sure that the clients needs and goals are met.",
      "link": "http://linkedin.com/in/emilyplewis/",
      "image": "https://media.licdn.com/mpr/mpr/shrinknp_100_100/AAEAAQAAAAAAAAy-AAAAJGZiNzgxOTNmLTFlMTItNDA2NC05NjYzLTg2NzNmMjVkYzk3NA.jpg",
      "date": "June 19, 2012, Emily worked with Leslie but at different companies"
    },
    {
      "name": "Alli Worthington",
      "role": "Executive Director at Propel Women and Author of Breaking Busy",
      "quote": "Leslie is a talented developer and designer who was friendly, professional and delivered excellent results.",
      "link": "http://linkedin.com/in/allisonworthington/",
      "image": "https://media.licdn.com/mpr/mpr/shrinknp_100_100/p/5/000/1f5/000/39fda60.jpg",
      "date": "June 12, 2012, Alli was a client of Leslie’s"
    },
    {
      "name": "Amanda Magee",
      "role": "Principal, Trampoline Design",
      "quote": "The majority of our projects with Leslie have been in website development. Her ability to forecast the most effective means of accomplishing both design and functionality goals has led to quick turnaround, very reasonable rates and consistently superior end results. <br><br>Outside of website work, we've also partnered with her on app development. Trampoline provided the design while Leslie acted as project manager and developer, which demonstrated that she also has strong leadership skills and flexibility. <br><br>As the way the internet is used continues to evolve at the speed of light, Leslie's ability to adapt and quickly identify the best platforms and practices, will only serve to increase her already significant value and expertise.",
      "link": "http://linkedin.com/in/amandamagee/",
      "image": "https://media.licdn.com/mpr/mpr/shrinknp_100_100/AAEAAQAAAAAAAAUrAAAAJDUwOGM4YjI3LWRlZjgtNGNhNS1hNTg2LTcxZjRhMTZiODEyMg.jpg",
      "date": "June 7, 2012, Amanda was a client of Leslie’s"
    },
    {
      "name": "Ryan Battles",
      "role": "Digital Marketer &amp; Growth Strategist",
      "quote": "It was wonderful to experience Leslie as Director of Marketing at Ellislab, as well as community liason.  She would actively participate in conversations with the software's user base, listening, asking questions, and offering a friendly voice to the company.  I looked forward to her round-up posts each week highlighting community news and new developments within the company.  I recommend Leslie as someone who is easy to get along with, fun to have around, and truly knows what she is doing in regards to web design, development, copywriting, and marketing.",
      "link": "http://linkedin.com/in/ryanbattles/",
      "image": "https://media.licdn.com/mpr/mpr/shrinknp_100_100/AAEAAQAAAAAAAArQAAAAJDE2ODA5MjdjLWNiODUtNDlkOC05NjRiLTc5OTdhMGExYzdlNg.jpg",
      "date": "May 31, 2012, Ryan worked with Leslie but at different companies"
    },
    {
      "name": "Michele Wilcox",
      "role": "Executive Virtual Assistant for Creative Business Owners",
      "quote": "While I do consider Leslie a personal friend, I've hired her for both professional and personal websites and blogs.  She's instrumental in aspects I know nothing about, and instructive on those things I can do myself.  Incredibly helpful, but also fun to work with.",
      "link": "http://linkedin.com/in/michelewilcox/",
      "image": "https://media.licdn.com/mpr/mpr/shrinknp_100_100/p/8/005/086/1c8/08be5eb.jpg",
      "date": "July 1, 2009, Michele was a client of Leslie’s"
    },
    {
      "name": "Sydney Cole",
      "role": "IT and Software Development at Cascade Dafo",
      "quote": "I love being able to recommend Leslie to my clients, because she is not only great at what she does - she is also a joy to work with. I recommend her wholeheartedly!",
      "link": "http://linkedin.com/in/sydneycole/",
      "image": "https://media.licdn.com/mpr/mpr/shrinknp_100_100/p/8/005/03a/09c/039748c.jpg",
      "date": "June 17, 2008, Sydney worked with Leslie in different groups"
    }
    }
  ]
}