{
  "items": [
  {
    "id": 2,
    "name": "Pappa Murphy's",
    "client": "Deloitte",
    "class": [
      "project_items--animation-center"
    ],
    "role": "Front-end Architect and Lead Developer for global team",
    "link": "https://pappamurphys.com",
    "description": "Managed a multi-discipline team of designers and developers, responsible for delivering a full UI redesign of the Pappa Murphy's website, and associated front-end templates. Worked closely with my counterpart in India, to integrate the front-end templates with a content management system.",
    "challenges": "Remote team was unfamiliar with some of the technologies  and tools used on the Front-End.",
    "solution": "We enabled the India team to move forward by creating templates and example guides from the US-based studio team and building static html for integration with clear guidlines.",
    "testimonial": [ {
      "name": "",
      "role" : "",
      "quote": "",
      "link": ""
    }],
    "media": {
      "preview":  "/static/projects/pm/pm-preview.png",
      "animation":
      {
        "frame": "macbook",
        "image": "/static/projects/pm/pm-preview-mov.gif",
        "mobile": "/static/projects/pm/pm-preview.png"
      },
      "more" : [
        "./path/to/image2",
        "./path/to/image3"
      ]},

    "technology": [
      "HTML",
      "SASS",
      "Jade",
      "Bootstrap",
      "Angular",
      "Gulp",
      "Node",
      "Npm",
      "Bower"
    ]
  },
  {
    "id": 3,
    "name": "Multiple Projects",
    "client": "Vector Media Group",
    "class": [
      "project_items--no-image",
      "project_items--display-testimony",
      "project_items--two-col-content"
    ],
    "role": "Lead Front-end Developer, Mentor, Advisor",
    "link": "",
    "description": "Vector Media Group is a New York web agency and Premier Google Partner with a strong focus on digital marketing and SEO. The majority of my time there was spent working on large API-powered Node applications. In addition to development, I also advised on the front-end architecture for a revamp of the award winning EL Education website.",

    "challenges": "Most clients are under NDA. Information is available on request.",
    "solution": "",
    "testimonial": [{
      "name": "Ben Smith",
      "role" : " Director of Technology",
      "quote": "Leslie is an extremely detailed and thoughtful frontend architect that dedicates herself to her craft. She takes the time and care required to fully understand project requirements and use cases. She excels at the \"human\" side of development as well, including leadership, empathy, and understanding user behavior. She deeply cares about her projects, and it shows in the final output.",
      "link": "https://www.linkedin.com/in/benjaminsmithweb",
      "image" : "/static/profiles/ben_s.jpg"
    }
    ],
    "media": [],
    "technology": [
      "Javascript",
      "Backbone.js",
      "Bootstrap",
      "Node",
      "Npm",
      "Bower",
      "Express Server",
      "Jenkins"
    ]
  },
  {
    "id": 4,
    "class": [
      "project_items--image_left",
      "project_items--display-testimony",
      "project_items--media-flex-center"
    ],
    "name": "HP Support",
    "client": "Deloitte",
    "role": "Front-end Architect",
    "link": "http://support.hp.com",
    "description": "Specified CSS and UI guidelines for team. Created UI templates from design team to integrate with backbone.js.",
    "challenges": "Maintaining 'native' feel to html5 app on android and iOS and utilize one set of code for both platforms. Integrate with INRIX API for traffic data and other endpoints.",
    "solution": "Component based templates for backbone.js allow re-use and simplified code making it easier to troubleshoot. Added conditional logic in the build for some device specific overrides to prevent too many collisions in properties. Worked closely with services team.",
    "testimonial": [{
      "name": "Andi Russu",
      "role": "Creative Director",
      "quote": "Leslie has been invaluable in putting in place and delivering a well architected and coded solution for the client. She has provided team management input numerous times and has overall benefited the team and the client in the process. Her emphasis on well formatted and structured code was essential on this project and has been of great value when integrating with our USI counterparts.",
      "link": "https://www.linkedin.com/in/andirusu/",
      "image": "/static/profiles/andy_r.jpg"
    }
    ],
    "media": {
      "preview":  "/static/projects/hp/hp_support_mac.png",
      "more" : [
        "./path/to/image2",
        "./path/to/image3"
      ]},
    "technology": [
      "HTML",
      "CSS",
      "SASS",
      "Backbone.js",
      "Phonegap",
      "Javascript",
      "PHP"
    ]
  },
  {
    "id": 5,
    "name": "Integris Dashboard",
    "client": "Integris",
    "role": "Front-end Architect and Advisor",
    "link": "https://integris.io",
    "description": " Integris required a front-end architect to develop a component-based styleguide based on design mockups, as well as structuring the right front-end framework to work with their API.",
    "challenges": "The API was in flux and the developers were busy handling service side and were not as familiar with Front-End UI elements. A previous version had been put together in Angular but staff admitted knowledge of Angular was not their strong suit.",
    "solution": "I created a component-based styleguide with plain HTML and CSS to build out pieces of the UI. We discussed options for frameworks and I created a vue.js project with routing and examples of components using the elements from the styleguide. The handoff process included training the developers on the UI side and getting them up to speed on the framework and base repo for future scaling and finishing implementation when the API was ready.",
    "class": [
      "project_items--mobile-image-display",
      "project_items--two-col-content"
    ],
    "testimonial": [{}],
    "media": {
      "preview": "/static/projects/integris/integris_ipad.png",
      "alt": "iPad in landscape with hands showing example Integris dashboard",
      "more" : [
        "/static/projects/integris/integris_ipad.png",
        "./path/to/image3"
      ]},
    "technology": [
      "Javascript",
      "Vue.js",
      "Foundation",
      "Node",
      "Npm",
      "Webpack",
      "SASS"
    ]
  },
  {
           "id": 6,
           "class": [
             "project_items--image_right",
             "project_items--display-testimony" ,
             "project_items--media-flex-end"
           ],
           "name": "Wells Fargo",
           "client": "Deloitte",
           "role": "Front-end Architect",
           "link": "",
           "description": "Created front-end workflow and styleguide out of JSON objects and Jade on a node server. Worked closely with Wells Fargo implementation team.",
           "challenges": " Strict Accessibility Guidelines guided UI. Strong communication necessary with Wells Fargo technical team for smooth implementation.",
           "solution": "Created templates out of components for reference as well templates conforming to the ADA requirements.",
           "testimonial": [{
             "name": "Adayna Gonzalez",
             "role": "Vice President, Digital Product Development at Wells Fargo Advisors",
             "quote": "You’ve got a great one in Leslie. She is on top of her game which is awesome!",
             "link": "https://www.linkedin.com/in/adayna/",
             "image": "/static/profiles/adayna_g.jpg"
           }
           ],
           "media": {
             "preview":  "/static/projects/wells/wells-preview.png",
             "more" : [
               "./path/to/image2",
               "./path/to/image3"
             ]},
           "technology": [
             "HTML",
             "CSS",
             "SASS",
             "Jade",
             "Webpack",
             "Bower",
             "Npm",
             "Node",
             "Bourbon\/Neat",
             "Javascript"
           ]
         },
  {
      "id": 1,
      "class": [
        "project_items--image_left",
        "project_items--display-testimony"
      ],
      "name": "MyLincoln App",
      "client": "INRIX",
      "role": "Lead Front-end UI Developer",
      "link": "",
      "description": "Specified, implemented, and enforced UI development guidelines, to ensure consistency within the codebase. Worked with the design team to translate design visuals in to UI templates, for use with Backbone.js.",
      "challenges": "Ensuring that an HTML5 application feels like a native app on both Android and iOS. Maintaining responsiveness whilst retrieving live traffic data from external APIs, over mobile networks of varying quality.",
      "solution": "Component based templates for backbone.js allow re-use and simplified code making it easier to troubleshoot. Added conditional logic in the build for some device specific overrides to prevent too many collisions in properties. Worked closely with services team.",
      "testimonial": [
        {
          "name": "Bill Shchwabel",
          "role": "SVP Marketing and Product",
          "quote": "Leslie came into INRIX on a part time basis (as a contractor) to do the Lincoln work.  Her work has always exceeded expectations given the time and budget allocated.  She has also taken a leadership role, in guiding and challenging the team to come up with better solutions.  She has never missed a delivery and works 24X7 to get the job done.",
          "link": "https://www.linkedin.com/in/billschwebel/",
          "image": "/static/profiles/bill_s.jpg"
        }
      ],
      "media": {
        "preview": "/static/projects/lincoln/Lincoln_Home.png",
        "more": [
          "./path/to/image2",
          "./path/to/image3"
        ]
      },
      "technology": [
        "HTML",
        "CSS",
        "SASS",
        "Backbone.js",
        "Phonegap",
        "Javascript"
      ]
    }
  ]
}
